soap-service/requests/issuePayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://pientaa.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:issuePaymentRequest>
            <gs:IssuePayment>
                <gs:userId>SomeRandomUserId</gs:userId>
                <gs:amount>100.0</gs:amount>
            </gs:IssuePayment>
        </gs:issuePaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>